microchip-pic-avr-examples/llc50w-power-voltage-mode-control-with-active-current-sharing/dspic33c-illc.X/mcc_generated_files/pwm.h
    PWM_MasterDutyCycleSet(masterDutyCycle);
    </code>
*/
inline static void PWM_MasterDutyCycleSet(uint16_t masterDutyCycle)
{
    MDC = masterDutyCycle;
}

/**
  @Summary
    Sets the phase value in count for the Master Time Base generator.

  @Description
    This routine is used to set the phase value in count for the Master Time Base generator.

  @Param
    masterPhase - Phase value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t masterPhase;

    masterPhase = 0xFF;
    
    PWM_MasterPhaseSet(masterPhase);
    </code>
*/
inline static void PWM_MasterPhaseSet(uint16_t masterPhase)
{
    MPHASE = masterPhase;
}

/**
  @Summary
    Sets the period value in count for the PWM generator specific Time Base.

  @Description
    This routine is used to set the period value in count for the PWM generator specific Time Base.

  @Param
    genNum - PWM generator number.
    period - PWM generator period value in count.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t period;
    
    period = 0xFFFF;
    PWM_PeriodSet(PWM_GENERATOR_1, period);
    </code>
*/
inline static void PWM_PeriodSet(PWM_GENERATOR genNum,uint16_t period)
{
    switch(genNum) { 
        case LLCPh1:
                PG1PER = period;              
                break;       
        case PH1SR:
                PG2PER = period;              
                break;       
        case LLCPh2:
                PG3PER = period;              
                break;       
        case PH2SR:
                PG4PER = period;              
                break;       
        default:break;    
    }   
}

/**
  @Summary
    Used to set the PWM generator specific duty cycle register.

  @Description
    This routine is used to set the PWM generator specific duty cycle register.

  @Param
    genNum      - PWM generator number.
    dutyCycle   - PWM generator duty cycle.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t dutyCyle;
    
    dutyCycle = 0xFF;
    PWM_DutyCycleSet(PWM_GENERATOR_1, dutyCycle);
    </code>
*/
inline static void PWM_DutyCycleSet(PWM_GENERATOR genNum,uint16_t dutyCycle)
{
    switch(genNum) { 
        case LLCPh1:
                PG1DC = dutyCycle;              
                break;       
        case PH1SR:
                PG2DC = dutyCycle;              
                break;       
        case LLCPh2:
                PG3DC = dutyCycle;              
                break;       
        case PH2SR:
                PG4DC = dutyCycle;              
                break;       
        default:break;    
    }  
}

/**
  @Summary
    Sets the phase value in count for the PWM generator specific Time Base.

  @Description
    This routine is used to set the phase value in count for the PWM generator specific Time Base.

  @Param
    genNum - PWM generator number.
    phase - PWM generator phase value in count.

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t phase;
    
    phase = 0xFFFF;
    PWM_PhaseSet(PWM_GENERATOR_1, phase);
    </code>
*/
inline static void PWM_PhaseSet(PWM_GENERATOR genNum,uint16_t phase)
{
    switch(genNum) { 
        case LLCPh1:
                PG1PHASE = phase;              
                break;       
        case PH1SR:
                PG2PHASE = phase;              
                break;       
        case LLCPh2:
                PG3PHASE = phase;              
                break;       
        case PH2SR:
                PG4PHASE = phase;              
                break;       
        default:break;    
    } 
}

/**
  @Summary
    Updates PWM override data bits with the requested value for a specific PWM generator.

  @Description
    This routine is used to updates PWM override data bits with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum          - PWM generator number.
    overrideData    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    uint16_t overrideData;

    overrideData = 0x01;
    
    PWM_OverrideDataSet(PWM_GENERATOR_1, overrideData);
    </code>
*/  
inline static void PWM_OverrideDataSet(PWM_GENERATOR genNum,uint16_t overrideData)
{
    switch(genNum) { 
        case LLCPh1:
                PG1IOCONLbits.OVRDAT = overrideData;              
                break;       
        case PH1SR:
                PG2IOCONLbits.OVRDAT = overrideData;              
                break;       
        case LLCPh2:
                PG3IOCONLbits.OVRDAT = overrideData;              
                break;       
        case PH2SR:
                PG4IOCONLbits.OVRDAT = overrideData;              
                break;       
        default:break;    
    }
}

/**
  @Summary
    Updates PWM override high data bit with the requested value for a specific PWM generator.

  @Description
    This routine is used to update PWM override high data bit with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum              - PWM generator number.
    overrideDataHigh    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    bool overrideDataHigh;

    overrideDataHigh = true;
    
    PWM_OverrideDataHighSet(PWM_GENERATOR_1, overrideDataHigh);
    </code>
*/  
inline static void PWM_OverrideDataHighSet(PWM_GENERATOR genNum,bool overrideDataHigh)
{
    switch(genNum) { 
        case LLCPh1:
                overrideDataHigh = ((overrideDataHigh & 0x0001)<<11);
                PG1IOCONLbits.OVRDAT = (PG1IOCONLbits.OVRDAT & 0xF7FF);
                PG1IOCONLbits.OVRDAT = (PG1IOCONLbits.OVRDAT | overrideDataHigh);
                break;
        case PH1SR:
                overrideDataHigh = ((overrideDataHigh & 0x0001)<<11);
                PG2IOCONLbits.OVRDAT = (PG2IOCONLbits.OVRDAT & 0xF7FF);
                PG2IOCONLbits.OVRDAT = (PG2IOCONLbits.OVRDAT | overrideDataHigh);
                break;
        case LLCPh2:
                overrideDataHigh = ((overrideDataHigh & 0x0001)<<11);
                PG3IOCONLbits.OVRDAT = (PG3IOCONLbits.OVRDAT & 0xF7FF);
                PG3IOCONLbits.OVRDAT = (PG3IOCONLbits.OVRDAT | overrideDataHigh);
                break;
        case PH2SR:
                overrideDataHigh = ((overrideDataHigh & 0x0001)<<11);
                PG4IOCONLbits.OVRDAT = (PG4IOCONLbits.OVRDAT & 0xF7FF);
                PG4IOCONLbits.OVRDAT = (PG4IOCONLbits.OVRDAT | overrideDataHigh);
                break;
        default:break;    
    }
}

/**
  @Summary
    Updates PWM override low data bit with the requested value for a specific PWM generator.

  @Description
    This routine is used to update PWM override low data bit with the requested 
    value for a specific PWM generator selected by the argument PWM_GENERATOR.

  @Param
    genNum             - PWM generator number.
    overrideDataLow    - Override data

  @Returns
    None
 
  @Example 
    <code>    
    bool overrideDataLow;

    overrideDataLow = true;
    
